Самые страшные тесты:

'//тут нет комментария'
'вот /*и тут тоже*/'
// "а тут есть, как жаль"
// 'тут тоже комментарий хоть и в кавычках/* dkfhsjdfg*/'
/* тут тоже "коментарий", правда
он будет идти долго
очень долго
// и только здесь закончится*/

"/*123*/ \\"/*123*/
\"/*123*/\"/*123*/
\\\" /*123*/\\\"/*123*/

'/*123*/ \\'/*123*/
\'/*123*/\'/*123*/
\\\' /*123*/\\\'/*123*/


"12345\" //678
"12345\\" //678
"12345\\\" //678
"12345\\\\" //678
"12345\\\\\" //678
"12345\\\\\\" //678

1'"///**/
"'
2'"/*//
*/"'
3'//"/**/"
'
4'/*"//
"*/'
5'/*"//
"*/'
6'/*//""
/'
7"'///**/
'"
8"'/*//
*/'"
9"//'/**/'
"
10"///*''*/
"
11"/*'//
'*/"
12"/*//''
*/"
13//'"/**/"'
14//'/*""*/'
15//"'/**/'"
16//"/*''*/"
17///*'""'*/
18///*"''"*/
19/*'"//
  "'*/
20/*'//""
   '*/
21/*"'//
  '"*/
22/*"//''
  "*/
23/*//'""'
  */
24/*//"''"
  */

0//
/0/
//0

10000
2000/
300/0
400//
50/00
60/0/
70//0
80///
9/000
10/00/
11/0/0
12/0//
13//00
14//0/
15///0
16////

0/*
0*/
/0*
/*0
*0/
*/0

new tests

10000
20000/
3000*
400/0
500//
600/*
700*0
800*/
900**
100/00
110/0/
120/0*
130//0
140///
150//*
160/*0
170/*/
180/**
190*00
200*0/
210*0*
220*/0
230*//
240*/*
250**0
260**/
270***
28/000
29/000/
30/00*
31/0/0
32/0//
33/0/*
34/0*0
35/0*/
36/0**
37//00
38//0/
39//0*
40///0
41////
42///*
43//*0
44//*/
45//**
46/*00
47/*0/
48/*0*
49/*/0
50/*//
51/*/*
52/**0
53/**/
54/***
55*000
56*000/
57*00*
58*0/0
59*0//
60*0/*
61*0*0
62*0*/
63*0**
64*/00
65*/0/
66*/0*
67*//0
68*///
69*//*
70*/*0
71*/*/
72*/**
73**00
74**0/
75**0*
76**/0
77**//
78**/*
79***0
80***/
81****

'не коммент'
"не коммент"
"//не коммент"
"/*не коммент*/"
"не"коммент"
'не ко"ммент'

"sadf//sd"
"sdf/*sdf*/sdf"

"",
    "// comment",
    "something; // comment",
    "'hello, world!'",
    "'// not a comment but it's OK to cut here too'... // a real comment"


	"",
    "",
    "something; ",
    "'hello, world!'",
    "'",

//////// вот такой коммент///////////////

//коммент
/*коммент*/
//коммент\
тоже
//коммент\\
тоже

//\
Бугагашеньки!
продолжаем писать страшные тесты...
printf("тут конечно же строка, но внезапно появляется \"'" + /* 232'"31 */ ", а потом вот \'!! Уверена, что это должно сломать всё!\
	   можно ещё и так поиздеваться\
	   но это уже не так страшно");
printf('тут конечно же в одинарных кавычках тоже, но внезапно появляется \", а потом вот \'!! Уверена, что это должно сломать всё!');

Да, и моё любимое
	// коментарий без переноса строки

